----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 224, 224]           1,792
              ReLU-2         [-1, 64, 224, 224]               0
            Conv2d-3         [-1, 64, 224, 224]          36,928
              ReLU-4         [-1, 64, 224, 224]               0
            Conv2d-5         [-1, 64, 112, 112]           9,408
            Conv2d-6         [-1, 64, 112, 112]           9,408
       BatchNorm2d-7         [-1, 64, 112, 112]             128
       BatchNorm2d-8         [-1, 64, 112, 112]             128
              ReLU-9         [-1, 64, 112, 112]               0
             ReLU-10         [-1, 64, 112, 112]               0
        MaxPool2d-11           [-1, 64, 56, 56]               0
        MaxPool2d-12           [-1, 64, 56, 56]               0
           Conv2d-13           [-1, 64, 56, 56]          36,864
           Conv2d-14           [-1, 64, 56, 56]          36,864
      BatchNorm2d-15           [-1, 64, 56, 56]             128
      BatchNorm2d-16           [-1, 64, 56, 56]             128
             ReLU-17           [-1, 64, 56, 56]               0
             ReLU-18           [-1, 64, 56, 56]               0
           Conv2d-19           [-1, 64, 56, 56]          36,864
           Conv2d-20           [-1, 64, 56, 56]          36,864
      BatchNorm2d-21           [-1, 64, 56, 56]             128
      BatchNorm2d-22           [-1, 64, 56, 56]             128
             ReLU-23           [-1, 64, 56, 56]               0
             ReLU-24           [-1, 64, 56, 56]               0
       BasicBlock-25           [-1, 64, 56, 56]               0
       BasicBlock-26           [-1, 64, 56, 56]               0
           Conv2d-27           [-1, 64, 56, 56]          36,864
           Conv2d-28           [-1, 64, 56, 56]          36,864
      BatchNorm2d-29           [-1, 64, 56, 56]             128
      BatchNorm2d-30           [-1, 64, 56, 56]             128
             ReLU-31           [-1, 64, 56, 56]               0
             ReLU-32           [-1, 64, 56, 56]               0
           Conv2d-33           [-1, 64, 56, 56]          36,864
           Conv2d-34           [-1, 64, 56, 56]          36,864
      BatchNorm2d-35           [-1, 64, 56, 56]             128
      BatchNorm2d-36           [-1, 64, 56, 56]             128
             ReLU-37           [-1, 64, 56, 56]               0
             ReLU-38           [-1, 64, 56, 56]               0
       BasicBlock-39           [-1, 64, 56, 56]               0
       BasicBlock-40           [-1, 64, 56, 56]               0
           Conv2d-41          [-1, 128, 28, 28]          73,728
           Conv2d-42          [-1, 128, 28, 28]          73,728
      BatchNorm2d-43          [-1, 128, 28, 28]             256
      BatchNorm2d-44          [-1, 128, 28, 28]             256
             ReLU-45          [-1, 128, 28, 28]               0
             ReLU-46          [-1, 128, 28, 28]               0
           Conv2d-47          [-1, 128, 28, 28]         147,456
           Conv2d-48          [-1, 128, 28, 28]         147,456
      BatchNorm2d-49          [-1, 128, 28, 28]             256
      BatchNorm2d-50          [-1, 128, 28, 28]             256
           Conv2d-51          [-1, 128, 28, 28]           8,192
           Conv2d-52          [-1, 128, 28, 28]           8,192
      BatchNorm2d-53          [-1, 128, 28, 28]             256
      BatchNorm2d-54          [-1, 128, 28, 28]             256
             ReLU-55          [-1, 128, 28, 28]               0
             ReLU-56          [-1, 128, 28, 28]               0
       BasicBlock-57          [-1, 128, 28, 28]               0
       BasicBlock-58          [-1, 128, 28, 28]               0
           Conv2d-59          [-1, 128, 28, 28]         147,456
           Conv2d-60          [-1, 128, 28, 28]         147,456
      BatchNorm2d-61          [-1, 128, 28, 28]             256
      BatchNorm2d-62          [-1, 128, 28, 28]             256
             ReLU-63          [-1, 128, 28, 28]               0
             ReLU-64          [-1, 128, 28, 28]               0
           Conv2d-65          [-1, 128, 28, 28]         147,456
           Conv2d-66          [-1, 128, 28, 28]         147,456
      BatchNorm2d-67          [-1, 128, 28, 28]             256
      BatchNorm2d-68          [-1, 128, 28, 28]             256
             ReLU-69          [-1, 128, 28, 28]               0
             ReLU-70          [-1, 128, 28, 28]               0
       BasicBlock-71          [-1, 128, 28, 28]               0
       BasicBlock-72          [-1, 128, 28, 28]               0
           Conv2d-73          [-1, 256, 14, 14]         294,912
           Conv2d-74          [-1, 256, 14, 14]         294,912
      BatchNorm2d-75          [-1, 256, 14, 14]             512
      BatchNorm2d-76          [-1, 256, 14, 14]             512
             ReLU-77          [-1, 256, 14, 14]               0
             ReLU-78          [-1, 256, 14, 14]               0
           Conv2d-79          [-1, 256, 14, 14]         589,824
           Conv2d-80          [-1, 256, 14, 14]         589,824
      BatchNorm2d-81          [-1, 256, 14, 14]             512
      BatchNorm2d-82          [-1, 256, 14, 14]             512
           Conv2d-83          [-1, 256, 14, 14]          32,768
           Conv2d-84          [-1, 256, 14, 14]          32,768
      BatchNorm2d-85          [-1, 256, 14, 14]             512
      BatchNorm2d-86          [-1, 256, 14, 14]             512
             ReLU-87          [-1, 256, 14, 14]               0
             ReLU-88          [-1, 256, 14, 14]               0
       BasicBlock-89          [-1, 256, 14, 14]               0
       BasicBlock-90          [-1, 256, 14, 14]               0
           Conv2d-91          [-1, 256, 14, 14]         589,824
           Conv2d-92          [-1, 256, 14, 14]         589,824
      BatchNorm2d-93          [-1, 256, 14, 14]             512
      BatchNorm2d-94          [-1, 256, 14, 14]             512
             ReLU-95          [-1, 256, 14, 14]               0
             ReLU-96          [-1, 256, 14, 14]               0
           Conv2d-97          [-1, 256, 14, 14]         589,824
           Conv2d-98          [-1, 256, 14, 14]         589,824
      BatchNorm2d-99          [-1, 256, 14, 14]             512
     BatchNorm2d-100          [-1, 256, 14, 14]             512
            ReLU-101          [-1, 256, 14, 14]               0
            ReLU-102          [-1, 256, 14, 14]               0
      BasicBlock-103          [-1, 256, 14, 14]               0
      BasicBlock-104          [-1, 256, 14, 14]               0
          Conv2d-105            [-1, 512, 7, 7]       1,179,648
          Conv2d-106            [-1, 512, 7, 7]       1,179,648
     BatchNorm2d-107            [-1, 512, 7, 7]           1,024
     BatchNorm2d-108            [-1, 512, 7, 7]           1,024
            ReLU-109            [-1, 512, 7, 7]               0
            ReLU-110            [-1, 512, 7, 7]               0
          Conv2d-111            [-1, 512, 7, 7]       2,359,296
          Conv2d-112            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-113            [-1, 512, 7, 7]           1,024
     BatchNorm2d-114            [-1, 512, 7, 7]           1,024
          Conv2d-115            [-1, 512, 7, 7]         131,072
          Conv2d-116            [-1, 512, 7, 7]         131,072
     BatchNorm2d-117            [-1, 512, 7, 7]           1,024
     BatchNorm2d-118            [-1, 512, 7, 7]           1,024
            ReLU-119            [-1, 512, 7, 7]               0
            ReLU-120            [-1, 512, 7, 7]               0
      BasicBlock-121            [-1, 512, 7, 7]               0
      BasicBlock-122            [-1, 512, 7, 7]               0
          Conv2d-123            [-1, 512, 7, 7]       2,359,296
          Conv2d-124            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-125            [-1, 512, 7, 7]           1,024
     BatchNorm2d-126            [-1, 512, 7, 7]           1,024
            ReLU-127            [-1, 512, 7, 7]               0
            ReLU-128            [-1, 512, 7, 7]               0
          Conv2d-129            [-1, 512, 7, 7]       2,359,296
          Conv2d-130            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-131            [-1, 512, 7, 7]           1,024
     BatchNorm2d-132            [-1, 512, 7, 7]           1,024
            ReLU-133            [-1, 512, 7, 7]               0
            ReLU-134            [-1, 512, 7, 7]               0
      BasicBlock-135            [-1, 512, 7, 7]               0
      BasicBlock-136            [-1, 512, 7, 7]               0
          Conv2d-137            [-1, 512, 7, 7]         262,656
            ReLU-138            [-1, 512, 7, 7]               0
        Upsample-139          [-1, 512, 14, 14]               0
          Conv2d-140          [-1, 256, 14, 14]          65,792
            ReLU-141          [-1, 256, 14, 14]               0
          Conv2d-142          [-1, 512, 14, 14]       3,539,456
            ReLU-143          [-1, 512, 14, 14]               0
        Upsample-144          [-1, 512, 28, 28]               0
          Conv2d-145          [-1, 128, 28, 28]          16,512
            ReLU-146          [-1, 128, 28, 28]               0
          Conv2d-147          [-1, 256, 28, 28]       1,474,816
            ReLU-148          [-1, 256, 28, 28]               0
        Upsample-149          [-1, 256, 56, 56]               0
          Conv2d-150           [-1, 64, 56, 56]           4,160
            ReLU-151           [-1, 64, 56, 56]               0
          Conv2d-152          [-1, 256, 56, 56]         737,536
            ReLU-153          [-1, 256, 56, 56]               0
        Upsample-154        [-1, 256, 112, 112]               0
          Conv2d-155         [-1, 64, 112, 112]           4,160
            ReLU-156         [-1, 64, 112, 112]               0
          Conv2d-157        [-1, 128, 112, 112]         368,768
            ReLU-158        [-1, 128, 112, 112]               0
        Upsample-159        [-1, 128, 224, 224]               0
          Conv2d-160         [-1, 64, 224, 224]         110,656
            ReLU-161         [-1, 64, 224, 224]               0
          Conv2d-162          [-1, 3, 224, 224]             195
================================================================
Total params: 28,976,451
Trainable params: 28,976,451
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 416.50
Params size (MB): 110.54
Estimated Total Size (MB): 527.61
----------------------------------------------------------------
